# GIT
brew 'git'
brew 'diff-so-fancy'

# UTILITY
brew 'fd'
brew 'rg'
brew 'fzf' 
brew 'bat'
brew 'jq'

# NODE
brew 'node'

# TMUX
brew 'tmux'

# ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

#CASK
cask 'alacritty'
cask 'alfred'
cask 'visual-studio-code'
cask 'firefox'
cask 'google-chrome'
cask 'chromium'
cask 'hammerspoon'
cask 'iterm2'
cask 'lastpass'
cask 'slack'

# FONTS
tap 'homebrew/cask-fonts'
cask 'font-meslo-for-powerline'
cask 'font-anonymous-pro'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-terminus'
cask 'font-ubuntu'
